app/Http/Controllers/TaskController.php

    public function index()
    {
        $tasks = Task::with('user')->get();

        return view('task.index')
            ->with('tasks', $tasks);
---
select * from `tasks`
select * from `users` where `users`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11)